In [2]:
# Get required libraries

import pandas as pd

In [3]:
# Instantiate a Pandas Series object using a list and a dictionary

even_series = pd.Series([2, 4, 6, 8, 10])

indexed_series = pd.Series({
    'aa': 1,
    'bb': 2,
    'cc': 3
})

In [4]:
even_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [5]:
indexed_series

aa    1
bb    2
cc    3
dtype: int64

In [6]:
# Change the index of a series to be ['a','b','c','d']

even_series = pd.Series([2, 4, 6, 8, 10])
even_series.index = ['a','b','c','d','e']

In [7]:
even_series

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [8]:
# Sort the values of a Series in place

even_series = pd.Series([2, 4, 6, 8, 10])
even_series.sort_values(inplace=True)

In [9]:
even_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [10]:
# Instantiate Data Frame using a dictionary

df = pd.DataFrame({
    'name': ['AAA','BBB','CCC'],
    'score': [95,67,73]
})

In [11]:
# Explore first and last 10 rows in a Data Frame

df.head(10)

  name  score
0  AAA     95
1  BBB     67
2  CCC     73

In [12]:
df.tail(10)

  name  score
0  AAA     95
1  BBB     67
2  CCC     73

In [13]:
# Read a CSV file into a Data Frame

required_cols = ['Country',
                 'Population',
                 'Area (sq. mi.)',
                 'Birthrate',
                 'Deathrate']

countries = pd.read_csv('/Users/kamalmishra/Downloads/countries of the world.csv',
                       usecols = required_cols,
                       decimal = ',')

In [14]:
countries.head()

           Country  Population  Area (sq. mi.)  Birthrate  Deathrate
0     Afghanistan     31056997          647500      46.60      20.34
1         Albania      3581655           28748      15.11       5.22
2         Algeria     32930091         2381740      17.14       4.61
3  American Samoa        57794             199      22.46       3.27
4         Andorra        71201             468       8.71       6.25